/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_nb_sys.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: htillman <htillman@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/16 23:12:55 by htillman          #+#    #+#             */
/*   Updated: 2019/02/23 17:18:25 by htillman         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fdf.h"

/*потенцияально следует переписать так, чтобы был
универсальный перевод в системы счисления*/

static int		ft_change(char c)
{
	/*замена буквенных обозначений системы
	счисления и преобразование чара в инт*/
	int			i;

	i = 0;
	if (c >= '0' && c <= '9')
		return ((int)(c - 48));
	while (i != 6)
	{
		if (c == ('A' + i) || c== ('a' + i))
			return (10 + i);
		i++;
	}
	return (-1);
}

int				ft_to_ten(char *word, int st)
{
	/*перевод из 16 в 10*/
	int			nb;
	int			s;
	int			rez;

	s = 5;
	nb = 0;
	rez = 0;
	while (word[st] != '\0')
	{
		if ((nb = ft_change(word[st])) == -1)
			return (-1);
		rez = rez + nb * (int)pow((double)16, (double)s);
		st++;
		s--;
	}
	return (rez);
}
